import Model3d from './images/backgroundImg/3dModel.JPG'
import erythrocytes from './images/backgroundImg/erythrocytes.JPG'
import leuco from './images/backgroundImg/leuco.JPG'
import tromb from './images/backgroundImg/tromb.JPG'

export const smthAbouteBlood = 
    { 
        h1:'Немного о клетках крови',
        
        p:'Кле́тки кро́ви, или кровяны́е кле́тки — клетки, входящие в состав крови и образующиеся в красном костном мозге в ходе гемопоэза. Существует три основных типа клеток крови: эритроциты (красные кровяные клетки), лейкоциты (белые кровяные клетки) и тромбоциты (кровяные пластинки). Численную долю объёма крови, приходящуюся на клетки (обычно на красные), называют гематокритом. У женщин его значение в норме составляет 0,37—0,47, у мужчин — 0,4—0,54. Более 99 % гематокрита приходится на эритроциты. Клетки крови выполняют разнообразные функции: переносят кислород и углекислый газ (эритроциты), обеспечивают работу иммунной системы (лейкоциты) и свёртываемость крови (тромбоциты). Иногда эритроциты, тромбоциты и лейкоциты в совокупности называют форменными элементами крови в связи с тем, что тромбоциты представляют собой фрагменты цитоплазмы мегакариоцитов, не имеют собственного ядра и некоторыми учёными не считаются клетками',
        img:Model3d,
    }
export const aboutErythro= {
    h1:'Эритроциты',
    p:`Зрелые эритроциты (нормоциты) представляют собой безъядерные клетки в форме двояковогнутого диска диаметром 7—8 мкм. Эритроциты образуются в красном костном мозге, откуда попадают в кровь в незрелом виде (в виде так называемых ретикулоцитов) и достигают окончательной дифференцировки через 1—2 дня после выхода в кровоток. Продолжительность жизни эритроцита составляет 100—120 суток. Отслужившие и повреждённые эритроциты фагоцитируются макрофагами селезёнки, печени и костного мозга. Образование эритроцитов (эритропоэз) стимулируется эритропоэтином, который образуется в почках при гипоксии.

    Важнейшая функция эритроцитов — дыхательная. Они переносят кислород от альвеол лёгких к тканям и углекислый газ от тканей к лёгким. Двояковогнутая форма эритроцита обеспечивает наибольшее отношение площади поверхности к объёму, что обеспечивает его максимальный газообмен с плазмой крови. Белок гемоглобин, содержащий железо, заполняет эритроциты и переносит весь кислород и около 20 % углекислого газа (остальные 80 % транспортируется в виде иона бикарбоната). Кроме того, эритроциты участвуют в свёртывании крови и адсорбируют на своей поверхности токсичные вещества. Они переносят разнообразные ферменты и витамины, аминокислоты и ряд биологически активных веществ. Наконец, на поверхности эритроцитов находятся антигены — групповые признаки крови.`,
    img:erythrocytes,
}
export const aboutLeuco= {
    h1:'Лейкоциты',
    p:`Лейкоциты — ядерные шаровидные клетки. В зависимости от типа гранул в цитоплазме их подразделяют на гранулоциты (нейтрофилы, эозинофилы, базофилы) и агранулоциты (лимфоциты и моноциты). Отличительная черта лейкоцитов — их подвижность, которая обеспечивается сократительными белками актином и миозином. Они могут даже выходить из кровеносных сосудов, проникая между клетками эндотелия. Основная функция лейкоцитов — защитная. Они фагоцитируют микроорганизмы, инородные частицы, продукты распада тканей, синтезируют и инактивируют различные биологически активные вещества, опосредуют реакции гуморального и клеточного иммунитета.

    Наиболее многочисленный тип лейкоцитов — нейтрофилы. После выхода из костного мозга они циркулируют в крови всего несколько часов, после чего оседают в различных тканях. Их главная функция — фагоцитоз обломков тканей и опсонизированных микроорганизмов. Таким образом, нейтрофилы, наряду с макрофагами, обеспечивают первичный неспецифический иммунный ответ.
    
    Эозинофилы в течение нескольких дней после образования остаются в костном мозге, потом на несколько часов выходят в кровоток и далее мигрируют в ткани, контактирующие с внешней средой (слизистые оболочки дыхательных и мочеполовых путей, а также кишечника). Эозинофилы способны к фагоцитозу, задействованы в аллергических, воспалительных и антипаразитарных реакциях. Они также выделяют гистаминазы, инактивирующие гистамин, и блокируют дегрануляцию тучных клеток.
    
    Базофилы — очень малочисленный тип лейкоцитов (не более 0—1 % общего числа лейкоцитов в крови), в их гранулах содержатся гистамин и гепарин. Они выходят из кровотока в ткани, где участвуют в аллергических реакциях, выделяя гистамин и другие вазоактивные вещества.
    
    Моноциты — самые крупные лейкоциты. После нескольких дней циркуляции в кровотоке они выходят в ткани и превращаются в макрофаги. Макрофаги — фагоцитирующие клетки, они найдены во всех тканях и органах. Они фагоцитируют из крови денатурированные белки, состарившиеся эритроциты, обломки клеток и внеклеточного матрикса. Они также поглощают находящиеся в тканях опсонизированные бактерии и после активации секретируют разнообразные ферменты, транспортные белки, интерлейкины, факторы роста, тромбоксаны, а также лизоцим и эндогенные пирогены.
    
    Лимфоциты подразделяют на T-лимфоциты и B-лимфоциты в зависимости от места их созревания (тимус или красный костный мозг соответственно). Они постоянно поступают в кровь с лимфой из лимфатических узлов. Лимфоциты обеспечивают специфический иммунитет. B-лимфоциты выделяют антитела. T-лимфоциты подразделяются на T-киллеров, обеспечивающих клеточный иммунный ответ, T-хелперов, которые поддерживают пролиферацию и дифференцировку B-лимфоцитов, и T-регуляторные клетки, подавляющие T-клеточный иммунный ответ после устранения угрозы. Выделяют также особую группу лимфоцитов  — натуральные киллеры, которые уничтожают раковые клетки, клетки, заражённые вирусами, и чужеродные клетки.`,
    img: leuco,
}
export const aboutPlateles= {
    h1:'Тромбоциты',
    p:'Циркулирующие в крови тромбоциты (две трети всех тромбоцитов, остальные накапливаются в селезёнке) участвуют в свёртывании крови и восстановлении целостности стенки сосуда после повреждения. Они способны слипаться друг с другом и со стенками сосудов, а также секретируют факторы роста, стимулирующие заживление ран. Тромбоциты образуются в костном мозге из мегакариоцитов, которые в определённый момент распадаются на множество кровяных пластинок.',
    img : tromb,
}
export const aboutСellFormation = {
    h1:'Образование',
    p: `Все кровяные клетки происходят из стволовых кроветворных (гематопоэтических) клеток, находящихся в костном мозге. Сначала они разделяются на популяции предшественников лимфоидных клеток и миелоидных клеток. Предшественники лимфоидных клеток дают начало натуральным киллерам, T-лимфоцитам и B-лимфоцитам. Предшественники миелоидных клеток развиваются в популяции мегакариоцитов (предшественников тромбоцитов), предшественников эритроцитов, тучных клеток и миелобластов. От миелобластов происходят базофилы, нейтрофилы, эозинофилы и моноциты.

    Образование эритроцитов (эритропоэз) стимулируется эритропоэтинами при нехватке кислорода в тканях. Содержание лейкоцитов в крови регулируется гормонами тимуса. В печени синтезируется тромбопоэтин, который стимулирует образование мегакариоцитов. Клетки стромы костного мозга и T-лимфоциты вырабатывают интерлейкин 3, который действует на стволовые кроветворные клетки.`,
    img: tromb,
}

